app/controllers/api/interviews_controller.rb

    def show
        @interview = Interview.find(params[:id])
---
SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

    def create
        @interview = Interview.new(interview_params)
        if @interview.save
---
INSERT INTO "interviews" ("application_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["application_id", 9], ["created_at", "2020-04-12 05:59:38.306084"], ["updated_at", "2020-04-12 05:59:38.306084"]]

    def update
        @interview = Interview.find(params[:id])
        if @interview.update(interview_params)
---
SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "interviews" SET "date" = $1, "time" = $2, "interview_type" = $3, "updated_at" = $4 WHERE "interviews"."id" = $5  [["date", "2020-01-01"], ["time", "13:00:00"], ["interview_type", "phone"], ["updated_at", "2020-04-12 05:35:44.574440"], ["id", 25]]