app/controllers/api/job_applications_controller.rb

INSERT INTO "job_applications" ("application_date", "company_name", "position", "job_posting_url", "company_site_url", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @job_application = JobApplication.new(job_application_params)
        if @job_application.save

SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "job_applications" SET "status" = $1, "updated_at" = $2 WHERE "job_applications"."id" = $3  [["status", "Offered"], ["updated_at", "2020-04-12 00:58:00.021643"], ["id", 6]]
---
    def update
        @job_application = JobApplication.find(params[:id])
        if @job_application.update(job_application_params)