app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6jVxs8EVb7WU94D3eJW2mg"], ["updated_at", "2020-04-11 06:12:30.514200"], ["id", 1]]
---
    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!